/*********************************************************************************
* 【编写时间】： 2011.07.07
* 【作    者】： 雁翎电子
* 【版    本】： V1.0
* 【网    站】： http://ylelectronic.taobao.com/ 
* 【Q      Q】： 348439350
* 【声    明】： 此程序仅用于学习与参考，引用请注明版权和作者信息！
* 【函数功能】： 独立按键测试			   			            
                 按1键跑马灯闪烁一次
			     按2键跑马灯闪烁二次
                 按3键跑马灯闪烁三次
			     按4键跑马灯闪烁四次
			    
* 【使用说明】： 注意先用跳线冒将J4短接，使用跑马灯模块
**********************************************************************************/

#include<reg52.h>    //包含单片机寄存器的头文件

#define uchar unsigned char
#define uint unsigned int

/* 函数申明 -----------------------------------------------*/
void delay(uint z);

/* 变量定义 ----------------------------------------------*/
sbit key1=P3^2;
sbit key2=P3^3;
sbit key3=P3^4;
sbit key4=P3^5;

/*
********************************************************************************
** 函数名称 ： main(void)
** 函数功能 ： 主函数
********************************************************************************
*/
void main()
{
	 P0 = 0;
	 
	 while(1)			 //无限扫描
	 { 
	 	if(key1==0)
		{
			delay(5);	  //消抖动
			if(key1==0)	  //确认按键被按下
			{
				while(!key1);//松手检测
				P1=0;
				delay(200);
				P1=0XFF;
			}
	   
		}
	   

		if(key2==0)
		{
			delay(5);	  //消抖动
			if(key2==0)	  //确认按键被按下
			{
				while(!key2);//松手检测
			    P1=0;
				delay(200);
				P1=0XFF;
				delay(200);
				P1=0;
				delay(200);
				P1=0XFF;
			}
		}
		if(key3==0)
		{
			delay(5);	  //消抖动
			if(key3==0)	  //确认按键被按下
			{
				while(!key3);//松手检测
				P1=0;
				delay(200);
				P1=0XFF;
				delay(200);
				P1=0;
				delay(200);
				P1=0XFF;
				delay(200);
				P1=0;
				delay(200);
				P1=0XFF;
				delay(200);
			}
		}
		if(key4==0)
		{
			delay(5);	  //消抖动
			if(key4==0)	  //确认按键被按下
			{
				while(!key4);//松手检测
				P1=0;
				delay(200);
				P1=0XFF;
				delay(200);
				P1=0;
				delay(200);
				P1=0XFF;
				delay(200);
				P1=0;
				delay(200);
				P1=0XFF;
				delay(200);
				P1=0;
				delay(200);
				P1=0XFF;
				delay(200);
			}
		}
		delay(10);	
	}
}

/*
********************************************************************************
** 函数名称 ： delay(uint z)
** 函数功能 ： 延时函数
********************************************************************************
*/
void delay(uint z)
{																							   
    uint i,j;
    for(i=z;i>0;i--)
        for(j=110;j>0;j--);
} 
