/******************************************************************************/
/*  Name:  PB3加二级RC滤波后用示波器可以看正弦波                              */
/*【编写时间】： 2011.07.07
* 【作    者】： 雁翎电子
* 【版    本】： V1.0
* 【网    站】： http://ylelectronic.taobao.com/ 
* 【Q      Q】： 348439350
* 【编译环境】： ICCAVR  
* 【函数功能】： 闪烁LED灯	
* 【晶    振】:  8M		
* 【芯    片】:  ATMEGA16A	 
* 【硬件连接】： J1短路帽接上      
/******************************************************************************/

#include <iom16v.h>
#include <macros.h>
#pragma data:code
// 128 点正弦波样本表
const unsigned char auc_SinParam[128] = {
64,67,70,73,76,79,82,85,88,91,94,96,99,102,104,106,109,111,113,115,117,118,120,121,
123,124,125,126,126,127,127,127,127,127,127,127,126,126,125,124,123,121,120,118,
117,115,113,111,109,106,104,102,99,96,94,91,88,85,82,79,76,73,70,67,64,60,57,54,51,48,
45,42,39,36,33,31,28,25,23,21,18,16,14,12,10,9,7,6,4,3,2,1,1,0,0,0,0,0,0,0,1,1,2,3,4,6,
7,9,10,12,14,16,18,21,23,25,28,31,33,36,39,42,45,48,51,54,57,60};
#pragma data:data
unsigned char x_SW = 8,X_LUT = 0;
#pragma interrupt_handler timer0_ovf_isr:17
void timer0_ovf_isr(void)
{
X_LUT += x_SW; // 新样点指针
if (X_LUT > 127) X_LUT -= 128; // 样点指针调整
OCR0 = auc_SinParam[X_LUT]; // 取样点指针到比较匹配寄存器
}
void main(void)
{
DDRB |= 0x08; // PB3(OC0)输出
TCCR0 = 0x71; // 相位调整PWM 模式，分频系数=1，正向控制OC0
TIMSK = 0x01; // T/C0 溢出中断允许
SEI(); // 使能全局中断
while(1);

}